[
  {
    "brand_img": "https://i.ibb.co/hBCHPN8/toyote-logo.jpg",
    "brand_title": "Toyota: Driven by Innovation, Committed to Sustainability",
    "brand_description": "Experience the future of mobility with Toyota, where cutting-edge innovation meets a steadfast commitment to environmental sustainability. Explore a world of automotive excellence that's shaping a greener, more exciting tomorrow.",
    "product_brand": "toyota_products",
    "slide_img_one": "https://i.ibb.co/TRfRC6h/toyota-product-1.jpg",
    "slide_img_tow": "https://i.ibb.co/WybxRqc/toyota-product-2.jpg",
    "slide_img_three": "https://i.ibb.co/3kQZXw2/toyota-product-3.jpg",
    "slide_img_four": "https://i.ibb.co/3kQZXw2/toyota-product-3.jpg",
    "advertisement_text_one": "Experience the Future of Mobility with Toyota: Where innovation meets the road, and every journey becomes an adventure in cutting-edge technology and unrivaled reliability. Discover the Toyota experience today!",
    "advertisement_text_tow": " Toyota is more than a brand; it's a promise of excellence. With a legacy of pioneering innovation, we're driving into the future to create a world that moves with confidence and sustainability.",
    "advertisement_text_three": "Your Drive Should Be Extraordinary: Toyota, where comfort, style, and performance converge to make every journey more than just a commute. Elevate your life with every drive.",
    "advertisement_text_four": "Toyota - Shaping a Greener, More Exciting Tomorrow. Join us in the quest for a sustainable and exciting automotive future. Where every drive is a step towards a better world."
  },
  {
    "brand_img": "https://i.ibb.co/qgGX8Jc/lamborghini-logo.jpg",
    "brand_title": "Lamborghini: Where Dreams Ignite and Engines Roar",
    "brand_description": "Lamborghini, the epitome of exotic elegance, ignites your wildest dreams with cars that embody art, passion, and unbridled power. Dive into the realm of automotive fantasies, where roaring engines set hearts on fire.",
    "product_brand": "lamborghini_products",
    "slide_img_one": "https://i.ibb.co/yyZdTDK/lamborghini-aventador-s-yellow-p1.jpg",
    "slide_img_tow": "https://i.ibb.co/L0bHS8K/black-lamborghini-huracan-p2.jpg",
    "slide_img_three": "https://i.ibb.co/G71xW2P/lamborghini-uras-yellow-p3.jpg",
    "slide_img_four": "https://i.ibb.co/5RFY5P0/lamborghini-sian-4k-HD-p4.jpg",
    "advertisement_text_one": "Unleash raw power, feel the thrill. Lamborghini, where dreams ignite. Born to dominate the road, a symphony of speed. Join the elite, experience excellence.",
    "advertisement_text_tow": "Precision, passion, performance. Lamborghini, an ode to speed. Crafted for the bold, designed for the few. Elevate your drive, redefine your limits.",
    "advertisement_text_three": "Innovate the impossible, embrace the extraordinary. Lamborghini, where innovation meets desire. A legacy of excellence, a future of wonders. Drive the dream, own the legend.",
    "advertisement_text_four": "UnCompromised perfection, breathtaking speed. Lamborghini, an icon of art and power. Elevate your journey, define your legacy. Born to be extraordinary, made for the fearless."
  },
  {
    "brand_img": "https://i.ibb.co/3F1CCxy/bmw-logo.jpgg",
    "brand_title": "BMW: Beyond Performance, It's a Lifestyle",
    "brand_description": "Beyond mere cars, BMW represents a lifestyle of exhilarating performance, unrivaled luxury, and enduring quality. Step into a world where driving isn't just a necessity but a profound experience.",
    "product_brand": "bmw_products",
    "slide_img_one": "https://i.ibb.co/Tr5r82m/bmw-7-series-1920-x-1080-wallpaper-a3n2nxndyy1rdt7n-p1.jpg",
    "slide_img_tow": "https://i.ibb.co/n8XMWcT/bmw-m8-competition-coupe-2019-5k-p2.jpg",
    "slide_img_three": "https://i.ibb.co/XS6CvZt/bmw-x7-xdrive40i-2018-4k-HD-p3.jpg",
    "slide_img_four": "https://i.ibb.co/ft2ZNYJ/bmw-m8-competition-coupe-2019-5k-p4.jpg",
    "advertisement_text_one": "Experience unrivaled luxury and innovation. BMW, where elegance meets performance. Drive the future with confidence, explore BMW today.",
    "advertisement_text_tow": "Elevate every journey. BMW, a legacy of excellence. Where power, precision, and style converge. Discover the art of driving.",
    "advertisement_text_three": "Innovate your drive. BMW, redefining automotive technology. Where the road becomes an adventure. Discover the thrill of the ultimate driving machine.",
    "advertisement_text_four": "Discover BMW, the epitome of driving pleasure. Where dreams ignite and hearts race. Precision, power, and passion in every ride."
  },
  {
    "brand_img": "https://i.ibb.co/3zBwxn9/mercedes-logo.jpg",
    "brand_title": "Mercedes-Benz: The Art of Luxury in Motion",
    "brand_description": "Mercedes-Benz epitomizes the art of luxury on wheels, where every detail exudes opulence and sophistication. Immerse yourself in a world where automotive design and engineering reach new heights of elegance.",
    "product_brand": "mercedes_products",
    "slide_img_one": "https://i.ibb.co/4mQy0h5/mercedes-benz-s-class-wallpaper-1920x1080-p1.jpg",
    "slide_img_tow": "https://i.ibb.co/MPjRnMC/2018-Mercedes-Maybach-S650-001-2000-scaled-p2.jpg",
    "slide_img_three": "https://i.ibb.co/HV03Yn3/marsidiz-product-p3.jpg",
    "slide_img_four": "https://i.ibb.co/0Cd3L6z/carpixel-net-2020-mercedes-benz-e-class-98369-hd-p3.jpg",
    "advertisement_text_one": "Mercedes-Benz, where luxury meets performance. Experience elegance and power in perfect harmony. The road becomes your canvas. Drive the future, own the legacy.",
    "advertisement_text_tow": "Elevate your journey with Mercedes-Benz. Craftsmanship, innovation, and the pursuit of excellence are our driving forces. Embrace the extraordinary, choose Mercedes-Benz.",
    "advertisement_text_three": "Innovation, style, and prestige define Mercedes-Benz. Where the journey is as extraordinary as the destination. Elevate your driving experience with timeless elegance and advanced technology.",
    "advertisement_text_four": "Mercedes-Benz, a symphony of luxury and precision. Crafted to redefine the road, designed to inspire. Make every drive exceptional. It's not just a car; it's a lifestyle."
  },
  {
    "brand_img": "https://i.ibb.co/wBPwCNv/tesla-logo.jpg",
    "brand_title": "Tesla: Leading the Charge to an Electrifying Future",
    "brand_description": "Join Tesla in leading the charge towards a sustainable and electrifying future. With cutting-edge electric vehicles, Tesla is rewriting the rules of driving and reshaping the automotive landscape.",
    "product_brand": "tesla_products",
    "slide_img_one": "https://i.ibb.co/GvkLtb1/tesla-s-p1.jpg",
    "slide_img_tow": "https://i.ibb.co/6rdPJsh/model-x-tesla-motors-HD-p2.jpg",
    "slide_img_three": "https://i.ibb.co/PgkgncY/tesla-3-p3.jpg",
    "slide_img_four": "https://i.ibb.co/Fzffx6H/model-y-tesla-motors-HD-p4.jpg",
    "advertisement_text_one": "Join the electric revolution. Tesla leads the charge with cutting-edge, emissions-free vehicles. Drive the future today, experience performance, sustainability, and innovation like never before.",
    "advertisement_text_tow": "Tesla: Driving change, not just cars. Elevate your journey with sustainable electric power. Unleash exhilarating performance and embrace a cleaner, brighter future. Drive electric, drive Tesla.",
    "advertisement_text_three": "Tesla, where innovation meets the open road. Feel the power of electric performance, zero emissions, and advanced autonomy. Explore the world with a greener, smarter, and thrilling driving experience.",
    "advertisement_text_four": "Experience Tesla, the future of mobility. Electric cars redefined. Discover sleek design, unmatched range, and the joy of emissions-free driving. Electrify your life, drive a Tesla today."
  },
  {
    "brand_img": "https://i.ibb.co/y4pwDTV/honda-logo.jpg",
    "brand_title": "Honda: Engineering Excellence for Every Journey",
    "brand_description": "Honda's legacy of engineering excellence is designed to make every journey memorable. Discover a brand that combines reliability, efficiency, and innovation to enhance your everyday adventures.",
    "product_brand": "honda_products",
    "slide_img_one": "https://i.ibb.co/TRfRC6h/toyota-product-1.jpg",
    "slide_img_tow": "https://i.ibb.co/SPTWQ24/2022-Honda-Civic-Sport-front-p2.jpg",
    "slide_img_three": "https://i.ibb.co/gZNqLST/honda-cr-v-ehev-black-edition-2020-5k-HD-p3.jpg",
    "slide_img_four": "https://i.ibb.co/PgYNZdZ/Honda-Insight-2019-wallpaper-p4.jpg",
    "advertisement_text_one": "Elevate Your Journey with Honda: Discover the Honda difference where innovation and reliability meet to create unforgettable driving experiences. Join us in celebrating the art of engineering excellence.",
    "advertisement_text_tow": "Unleash Your Drive with Honda: Honda vehicles are designed to take your daily commutes and weekend adventures to the next level. Get behind the wheel of a brand that redefines performance and practicality.",
    "advertisement_text_three": "Honda: Where Efficiency Meets Excitement: Experience the perfect blend of fuel efficiency and thrilling performance. With Honda, every drive becomes an efficient and exhilarating journey.",
    "advertisement_text_four": "Innovate Your Lifestyle with Honda: Honda is more than a car; it's a lifestyle. Discover a world of innovation, connectivity, and style that makes every mile feel extraordinary."
  }
]
